[
  {
    "id": 1770313602431,
    "title": "J0 - Début des recherches",
    "date": "2026-02-02",
    "badges": [
      {
        "text": "Biblio",
        "color": "#e01b24"
      },
      {
        "text": "Idée de TIPE",
        "color": "#3584e4"
      }
    ],
    "summary": "\nInformations sur la séance :\n→ amélioration site web : squelette + back end \n→ début bibliographie\n",
    "content": " <p>lecture article université de pau : <br>\n 1) https://olegoaer.perso.univ-pau.fr/works/GDR_GPL_2020___logiciels_verts.pdf\n→ bonne idée des TIPE / mise au point sur les enjeux énergétiques actuels.<br>\n 2 ) CNRS : info sur le gaspillage énergétique informatique : \nhttps://lejournal.cnrs.fr/articles/numerique-le-grand-gachis-energetique +<br>\n3) article théorie des noeuds introduction : https://archipel.uqam.ca/2017/1/M9262.pdf<br>\n<br></p><p>\n→ Comment optimiser la génération automatique de tests de programmes. <br> Application : les programmes informatiques ont un coût énergétique et en plus les programmes de test sont eux aussi coûteux. Calculer le coût d’un programme est donc compliqué de part le fait que même le programme qui mesure le coût énergétique augmente le coût de l’opération. Cela devient d’autant plus problématique que lorsque de nombreux programme s'exécute les coûts de test augmente (cela arrive donc fréquemment, engendrant une consommation plus grande d’énergie).<br>\npotentiel arbre de recherche : complexité temporel / espace. Automatisation / modélisation;<br>\nMatière : informatique / mathématiques<br>\ncf : 1 / 2<br>\n</p><p>\n→ Comment optimiser les équipements et les agencements data center pour baisser la consommation énergétique. <br>\nPermet une baisse des coûts liée à l'usage de la data autant financier pour les opérateurs et les utilisateurs. Car les câbles sont de grands consommateurs d’énergie car bourrés d'antennes de routeurs etc. Potentiel avec Marseille ville de la data. <br>\nPotentiel arbre de recherche : théorie de nœuds → longueur, cheminement etc. technologie physique derrière les câbles / optimisation en lien avec la théorie des nœuds.  Informatique : hardware / optimisation logiciels etc <br>\nMatière : informatique / physique / mathématiques.<br>\ncf) 2 / 3<br>\nNe pas oublier de personnalisée la chose: application possible avec contrainte physique ou alors sur des pays en développement. <br>\n<br></p>\nFin journée"
  }
]